const fs = global.nodemodule["fs-extra"];
module.exports.config = {
  name: "goibot",
  version: "1.0.1",
  hasPermssion: 0,
  credits: "Fixed By Piyush Kumar",
  description: "goibot",
  commandCategory: "Noprefix",
  usages: "noprefix",
  cooldowns: 5,
};
module.exports.handleEvent = async function({ api, event, args, Threads, Users }) {
  var { threadID, messageID, reason } = event;
  const moment = require("moment-timezone");
  const time = moment.tz("Asia/Kolkata").format("DD/MM/YYYY || HH:mm:ss");
  var idgr = `${event.threadID}`;
  var id = event.senderID;
  var name = await Users.getNameUser(event.senderID);

  var tl = ["["🖤💔Doηʈ BelıvƏ Aηɣoηə PeoplƏ Cɑη ChɑηgƏ Aηɣtıмə🙂💔🦋"-[🥀] " ,
"🎭•×____🔐🖇️  °☆Oɣ ı hαtƏ 💔LovƏ ı Wαs αwʜ Grεαt AlοηƏ🌚LıfƏ Appııə LıfƏ•×🖕🏻😌  🎭•×____🖤🖇️ ",  
"🎭    - ;))•°🎭  💋___☘¼-_🍁🐰_°Twɩŋĸɭɘ Twɩŋĸɭɘ Lɩttɭɘ Stʌʀ ʜot ʜot ʛɩʀɭ's ɩŋ ɱƴ Cʌʀ┼🐰─┼ ★🦋-[🥀] ",
"Sɘxƴ Mʋŋɗʌ 👅°• "
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

[|==>𝐌𝐀𝐃𝐄 𝐁𝐘 𝐏𝐈𝐘𝐔𝐒𝐇 𝐀2𝐙 𝐓𝐑𝐈𝐂𝐊𝐒<==|]
▶︎ [ Bio No-1 ]

{{°"--💋√^^



🌴____"✩◔ιf ɣσʋ тʜɪɴк ι ɑм вα∂ ʈʜɑɴ
ɣσʋ’ʀɘ ωɽσηηg, ι’м ʈʜɘ ωσɽѕʈ◔🍁_✩"



Hʌcĸɘʀ°💋}}",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-2 ]

^^))__☘️




💋™Excʋsɘ Mɘ, 
I Foʋŋɗ Soɱɘtʜɩŋʛ Uŋɗɘʀ Mƴ Sʜoɘs 
Oʜ, Its Yoʋʀ Attɩtʋɗɘ°😜



Rɘpoʀtɘʀ™🍂",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-3 ]

❤☘¼-__🍁




🎀___"✩Tʜoɗɩ jʛʜ ɗɘ ɗɘ ɱᴜjʜɘ(^^)
*)) tɘʀɘ pʌS ĸʌʜɩ ʀɘH jʌ	ʋ ɱɘH:💯


Y
:)Cɭoŋɘʀ🌿",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-4 ]
🪽❤️‍🩹_☘¼-_🍁

🪽🦋__✩Tʋɱʜɘ Uʜɩ CʜʌʜɘGɘ Jʌɓ Tĸ H ɗʋɱ 
Bʜʋt pƴʌʀ ĸʀtɘ H Tʋɱĸo Sʌŋɱ✩__🦋

(:Rɘʌctor🥀",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-5]
💋___☘¼-_🍁



🐰_°Twɩŋĸɭɘ Twɩŋĸɭɘ Lɩttɭɘ Stʌʀ ʜot ʜot ʛɩʀɭ's ɩŋ ɱƴ Cʌʀ┼🐰─┼ ★

🦋"-[🥀]

Sɘxƴ Mʋŋɗʌ 


👅°•",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-6 ]

"☘¼-_🎋



🌴____"✩◔If ɣoʋ TʜɪɴK I ɑм BAD ʈʜɑɴ🌿ɣoʋ’ʀɘ wɽoηηG, I’м ʈʜɘ woɽsʈ◔🌴
"✩"___🎋



"🍀½-_🌱",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-7 ]
🔰💯🔥🍁_____|" me 
       

" Ԁoŋ’ţ ɰαıţ ғoя ţђə pəяғəċţ moɱəŋţ ~ 🥀
' ţαҡə ţђə moɱəŋţ αŋԀ ɱαҡə ıţ pəяғəċţ "~ 🙂
                  
                     🐰❣🎀- 🎀❣🐰",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-8 ]

((°❣"___səvən  bıllıon  smılə's  ın  ʈhıs  world  buʈ  ɣour's  ıs  mɣ  fαvourıʈəs___"😌

▶︎ [ Bio No-9]
"-🌿🍁





- Soməʈııməs ' 🌿 ıʈ'x Bəttəɽ ʈo sʈαɣ Sıɭəŋʈ aŋd Smıɭə"- ￼;)) 🌼🍂






-Piyush'',
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-10]
⬇_______[❣] °•sʈɣɭɘ ιs ʌ ɽɘƒɭɘɕʈι❍η
❍ƒ ɣ❍ʋɽ ʌʈʈιʈʋdɘ aηd ɣ❍ʋɽ ρɘɽs❍ηʌℓιʈɣ•°★👑

#Piyush👣👅",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-11]

🌝





┏━━━━━°⚡•°⚡°•━━━━━┓
~ ️ 𝐏𝐈𝐘𝐔𝐒𝐇 𝐀2𝐙 𝐓𝐑𝐈𝐂𝐊𝐒~
┗━━━━━°⚡•°°⚡•━━━━━┛




🌝",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-12]
┼──"-🌿





^^★☆┼ •° Kəəp TɑlʞıŋG Bıʈch Yoʋ'ɽə MɑʞıŋG Məh Fɑɱoʋx__^^"-






─┼
ʟøṽε яεḉ⊥øя 💜",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-13]
🍾’






- Intoxicated With Mad








💞",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-14]

*- ||☘️ ❤️👏 :-)

Вαвy ' ωαทτ °ℓυsн " кiss 👅😘💦

~!! °|| 😘❤️🍫

✍🍾


🍾𝐒𝐨𝐦əʈıı𝐦ə𝐬 ' ☘ ıʈ'𝐱 𝐁ə𝐭𝐭əɽ ʈ𝐨 𝐬ʈαɣ 𝐒ıɭəŋʈ 𝐚ŋ𝐝 𝐒𝐦ıɭə"🎧



🍷🔐
Ｒｅａｃｔｏｒ",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-15]
🐬


🎭•×____🔐🖇️  °☆Oɣ ı hαtƏ 💔LovƏ ı Wαs αwʜ Grεαt AlοηƏ🌚LıfƏ Appııə LıfƏ•×🖕🏻😌  🎭•×____🖤🖇️  


🐬",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-16]
💸


- ;))_•°🖤  - Doηʈ BelıvƏ Aηɣoηə ♡- PeoplƏ Cɑη ChɑηgƏ Aηɣtıмə 🙂💔   ✨- ;))•°🎭  


💸",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-17]
😐


-°👑°•★]  ☆ıf γ❍ʋ Dσηʈ ɭιkə Mə ßʋɣ ɑ ɱʌρ🗺Gəʈ ɑ Cɑr🏎 ʌηd G❍ ʈ❍ həɭɭ💦🖕◔☆  -🎭_•★ ]   


😐",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-18]

____:))💌✍  🖇✧👅“Fʋcĸ🖕tʜɘ woʀɭɗ ʌŋɗ ŋɘvɘʀ tɘɭɭ tʜɘɱ I ɭovɘ ❣️ƴoʋ.”:))🙂💔 ____=)●✌🏴  ",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ

▶︎ [ Bio No-19]

🍷


_-🎬 )-🎧  ~HappıınƏxx ıs n❍ʈ s❍mƏʈHınɡ  ɽƏadɣ  madƏ✨  Iʈ c❍mƏx fɽ❍m y❍uɽ ❍wn acʈı❍nx💜👅  Eddy✨🌸🦋  


🍷",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
▶︎ [ Bio No-20]

┏━•°🎶°🍷🍒  


- YsH ! 4m cr4zy, normal !s bOr!Ng fOr m33 <)) 🤟💥  


┗━•°🎶°🍷🍒  ",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
▶︎ [ Bio No-21]


━━•°⚀ ◥❖◤ •_🌸✨  - S!mpL!c!Ty !s 4lsO 4 f4sh!On 3veryOne c4NT 4ffOrD ))× 🔥💦  ••____🌸 ••◥❖◤ •⚀°•━━  ",

"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
▶︎ [ Bio No-22]


9) ‏🍒💋:)🌿  🐰_°Twɩŋĸɭɘ Twɩŋĸɭɘ Lɩttɭɘ Stʌʀ✨ʜot ʜot 💋ʛɩʀɭs ɩŋ ɱƴ Cʌʀ┼●🐰─┼ ★  🦋•[🥀]  ",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
▶︎ [ Bio No-23]


10) -[🎩]-  🎀___✩ ◔If ɣoʋ TʜɪɴK I ɑм BAD ʈʜɑɴ ɣoʋ’ʀɘ wɽoηηG, I’м ʈʜɘ woɽsʈ◔ ⚘ ✩___★🎸  Mʀ_є∂∂у[🎩]  ",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
▶︎ [ Bio No-24]

11) 💋___☘¼-_🍁  💋___✩Tʋɱʜɘ Uʜɩ CʜʌʜɘGɘ Jʌɓ Tĸ H ɗʋɱ  Bʜʋt pƴʌʀ ĸʀtɘ H Tʋɱĸo Sʌŋɱ✩___💋  (:əɗɗƴ🖤🖇️  ",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
▶︎ [ Bio No-25]

12) {{°-🎀√^^  🌴____✩◔ιf ɣσʋ тʜɪɴк ι ɑм вα∂💋ʈʜɑɴ Ɣσʋ’ʀɘ ωɽσηηg, ι’м ʈʜɘ ωσɽѕʈ🎭◔🍁_✩  Əɗɗƴ°🙂}} ",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
▶︎ [ Bio No-26]

13) 👅🔥°•^)  Excʋsɘ Mɘ💁🏻‍♂️ I Foʋŋɗ Soɱɘtʜɩŋʛ Uŋɗɘʀ Mƴ Sʜoɘs👟 Oʜ, Its Yoʋʀ Attɩtʋɗɘ°😜  •⊰əɗɗƴ:))😈 ",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
▶︎ [ Bio No-27]

14)  _-👫)-🎧  🎀___✩Tʜoɗɩ jʛʜ ɗɘ ɗɘ ɱᴜjʜɘ(^^) *)) tɘʀɘ pʌS ĸʌʜɩ ʀɘH jʌʌʋ ɱɘH  -°💔°•★]  ",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
▶︎ [ Bio No-28]


15) ✨- ;))•-🦋  ‏🖇️🍁 × • Ɣ❍υ Cʌη C❍ρƔ MəĦ ßυʈ Ɣ❍υ Cʌηʈ ßē • ×🖕🏻😌  ✨- ;))•°🎭  ",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
▶︎ [ Bio No-29]


16) 🦋 -🌸  👑°•★_ıɱ ɭııʞƏ ɑ Bʋʈʈəɽʆɭɣ🦋 pɽəʈʈɣ✨ʈ❍ səƏ 🌝 :)) Ħɑɽd ʈ❍ cɑʈcɦ_•°🖤  Bəɭɭɑ👸🏻-🌸 ",
"
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
▶︎ [ Bio No-30]

⚀✇╬─☞Eɗɩtoʀ☜─╬✇⚃


⚅✇╬─☞Tʀɩcĸɚʀ☜─╬✇⚂


⚅✇╬─☞ʀɚpoʀtɘʀ☜─╬✇⚁


⚅✇╬─☞Ɽɚɑcʈoʀ☜─╬✇⚁

ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ",

];
"];
  var rand = tl[Math.floor(Math.random() * tl.length)]
   mess = "{name}"
  if (event.body.indexOf("Bio") == 0 || (event.body.indexOf("bot") == 0)) {
    var msg = {
      body: `🔶${name}🔶,  \n\n『\n   ${rand} 』\n\n❤️𝙲𝚛𝚎𝚍𝚒𝚝𝚜:𝐏𝐢𝐲𝐮𝐬𝐡 𝐂𝐡𝐚𝐮𝐡𝐚𝐧🌹 `
    }
    return api.sendMessage(msg, threadID, messageID);
  };

}

module.exports.run = function({ api, event, client, __GLOBAL }) { }
